app/controllers/tasks_controller.rb

	def index
		@tasks = Task.where(user_id: params[:user_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 100

	def create
		@task = Task.create(content: params[:content], user_id: params[:user_id])
---
INSERT INTO "tasks" ("complete", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["complete", false], ["content", "hello"], ["created_at", Fri, 18 Jul 2014 02:38:58 UTC +00:00], ["updated_at", Fri, 18 Jul 2014 02:38:58 UTC +00:00], ["user_id", 1]]

		task = Task.find(params[:id])
		task.update_attributes(content: params[:content], user_id: params[:user_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "content" = 'hello', "user_id" = 1000, "updated_at" = '2014-07-18 03:05:57.697169' WHERE "tasks"."id" = 2